# Задайте список из нескольких чисел. 
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# list = [2, 3, 5, 9, 3]
# sum1 = 0
# for i in range(len(list)):
#     if  i%2 ==1:
#         sum1 = list[i]+sum1
#         i+=1
# print(sum1)


# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# list = [2, 3, 4, 5, 6]
# # list = [2, 3, 5, 6]
# i = 0
# array = []
# n=len(list)
# while i < (n)/2:
#     a = list[i]*list[-i-1]
#     array.append(a)
#     i+=1
# print(array)



# Задайте список из вещественных чисел. 
# Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# first = [1.1, 1.2, 3.1, 5, 10.01]           
# maxPoint = round ( (first[0]) % 1,2 )       # округлила, т. к. дает много знаков после запятой у последнего значения. не применимо для большего количества знаков после запятой
# minPoint = round ( (first[0]) % 1,2 )
# for i in range(len(first)):
#     a = round ( (first[i]) % 1,2 )
#     # print(a)
#     if a ==0:
#         pass                              
#     elif a>maxPoint:
#         maxPoint=a
#     elif a<minPoint:
#         minPoint=a
# print(maxPoint-minPoint)



# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

# num10=int(input('введите число: '))
# num2= ''
# while num10 > 0:
#     num2 = str(num10 % 2) + num2
#     num10 = num10 // 2
# print(num2)





# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи](https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8#:~:text=%D0%92%20%D0%BC%D0%B0%D1%82%D0%B5%D0%BC%D0%B0%D1%82%D0%B8%D0%BA%D0%B5%2C%20%D1%87%D0%B8%D1%81%D0%BB%D0%B0%20%D0%BD%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8%20%E2%80%94%20%D0%BE%D1%82%D1%80%D0%B8%D1%86%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%20%D0%B8%D0%BD%D0%B4%D0%B5%D0%BA%D1%81%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D1%8B%D0%B5%20%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82%D1%8B%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%D1%81%D1%82%D0%B8%20%D1%87%D0%B8%D1%81%D0%B5%D0%BB%20%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8.)

# def negafib(n):
#     if n in [1,2]:
#         return 1
#     else:
#         return negafib(n+2)-negafib(n+1)
# def fib(n):
#     if n in [0]:
#         return 0
#     if n in [1,2]:
#         return 1
#     else:
#         return fib(n-1)+fib(n-2)

# k=int(input('введите число: '))
# n = []
# e  = -k
# for e in range(-k,0):
#     n.append(negafib(e))
# for i in range(0,k+1):
#     n.append(fib(i))
# print(n)                                    
